Tekla.Structures.Internal.dotGetAdvancedOption_t
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.#ctor(System.String,System.Int32,System.Int32)
Initializes a new instance of the Tekla.Structures.Internal.dotGetAdvancedOption_t struct. DO NOT USE! For internal usage only!
OptionName: Name of the option.
OptionType: Type of the option.
ValueStringIteration: The value string iteration.
Throws System.ArgumentException: Invalid advanced option variable name.

Tekla.Structures.Internal.dotGetAdvancedOption_t.aName
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.Type
The type

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueBool
The value bool

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueInt
The value int

Tekla.Structures.Internal.dotGetAdvancedOption_t.aValueString
a value string

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueDouble
The value double

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueStringIteration
The value string iteration